---
kind: other
id: Properties.T:Autodesk.Revit.DB.ColorWithTransparency
source: html/faaba9ad-a509-adf7-379b-e007bc203750.htm
---
# ColorWithTransparency Properties

Specifies whether the .NET object represents a valid Revit entity.